espressif/esp-idf/components/soc/esp32h4/register/soc/rmt_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: FIFO R/W registers */
/** Type of chndata register
 *  The read and write data register for channel n by APB FIFO access.
 */
typedef union {
    struct {
        /** chndata : HRO; bitpos: [31:0]; default: 0;
         *  Read and write data for channel n via APB FIFO.
         */
        uint32_t chndata:32;
    };
    uint32_t val;
} rmt_chndata_reg_t;


/** Group: Configuration registers */
/** Type of chnconf0 register
 *  Configuration register 0 for channel n
 */
typedef union {
    struct {
        /** tx_start_chn : WT; bitpos: [0]; default: 0;
         *  Configures whether to enable sending data in channel n.
         *  0: No effect
         *  1: Enable
         */
        uint32_t tx_start_chn:1;
        /** mem_rd_rst_chn : WT; bitpos: [1]; default: 0;
         *  Configures whether to reset RAM read address accessed by the transmitter for
         *  channel n.
         *  0: No effect
         *  1: Reset
         */
        uint32_t mem_rd_rst_chn:1;
        /** apb_mem_rst_chn : WT; bitpos: [2]; default: 0;
         *  Configures whether to reset RAM W/R address accessed by APB FIFO for channel n.
         *  0: No effect
         *  1: Reset
         */
        uint32_t apb_mem_rst_chn:1;
        /** tx_conti_mode_chn : R/W; bitpos: [3]; default: 0;
         *  Configures whether to enable continuous TX mode for channel n.
         *  0: No Effect
         *  1: Enable
         *  In this mode, the transmitter starts transmission from the first data. If an
         *  end-marker is encountered, the transmitter starts transmitting data from the first
         *  data again. if no end-marker is encountered, the transmitter starts transmitting
         *  the first data again when the last data is transmitted.
         */
        uint32_t tx_conti_mode_chn:1;
        /** mem_tx_wrap_en_chn : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable wrap TX mode for channel n.
         *  0: No effect
         *  1: Enable
         *  In this mode, if the TX data size is larger than the channel's RAM block size, the
         *  transmitter continues transmitting the first data to the last data in loops.
         */
        uint32_t mem_tx_wrap_en_chn:1;
        /** idle_out_lv_chn : R/W; bitpos: [5]; default: 0;
         *  Configures the level of output signal for channel n when the transmitter is in idle
         *  state.
         */
        uint32_t idle_out_lv_chn:1;
        /** idle_out_en_chn : R/W; bitpos: [6]; default: 0;
         *  Configures whether to enable the output for channel n in idle state.
         *  0: No effect
         *  1: Enable
         */
        uint32_t idle_out_en_chn:1;
        /** tx_stop_chn : R/W/SC; bitpos: [7]; default: 0;
         *  Configures whether to stop the transmitter of channel n sending data out.
         *  0: No effect
         *  1: Stop
         */
        uint32_t tx_stop_chn:1;
        /** div_cnt_chn : R/W; bitpos: [15:8]; default: 2;
         *  Configures the divider for clock of channel n.
         *  Measurement unit: rmt_sclk
         */
        uint32_t div_cnt_chn:8;
        /** mem_size_chn : R/W; bitpos: [18:16]; default: 1;
         *  Configures the maximum number of memory blocks allocated to channel n.
         */
        uint32_t mem_size_chn:3;
        uint32_t reserved_19:1;
        /** carrier_eff_en_chn : R/W; bitpos: [20]; default: 1;
         *  Configures whether to add carrier modulation on the output signal only at
         *  data-sending state for channel n.
         *  0: Add carrier modulation on the output signal at data-sending state and idle state
         *  for channel n
         *  1: Add carrier modulation on the output signal only at data-sending state for
         *  channel n
         *  Only valid when RMT_CARRIER_EN_CHn is 1.
         */
        uint32_t carrier_eff_en_chn:1;
        /** carrier_en_chn : R/W; bitpos: [21]; default: 1;
         *  Configures whether to enable the carrier modulation on output signal for channel n.
         *  0: Disable
         *  1: Enable
         */
        uint32_t carrier_en_chn:1;
        /** carrier_out_lv_chn : R/W; bitpos: [22]; default: 1;
         *  Configures the position of carrier wave for channel n.
         *  0: Add carrier wave on low level
         *  1: Add carrier wave on high level
         */
        uint32_t carrier_out_lv_chn:1;
        uint32_t reserved_23:1;
        /** conf_update_chn : WT; bitpos: [24]; default: 0;
         *  Synchronization bit for channel n.
         */
        uint32_t conf_update_chn:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} rmt_chnconf0_reg_t;

/** Type of chmconf0 register
 *  Configuration register 0 for channel m
 */
typedef union {
    struct {
        /** div_cnt_chm : R/W; bitpos: [7:0]; default: 2;
         *  Configures the clock divider of channel m.
         *  Measurement unit: rmt_sclk
         */
        uint32_t div_cnt_chm:8;
        /** idle_thres_chm : R/W; bitpos: [22:8]; default: 32767;
         *  Configures RX threshold.
         *  When no edge is detected on the input signal for continuous clock cycles longer
         *  than this field value, the receiver stops receiving data.
         *  Measurement unit: clk_div
         */
        uint32_t idle_thres_chm:15;
        /** mem_size_chm : R/W; bitpos: [25:23]; default: 1;
         *  Configures the maximum number of memory blocks allocated to channel m.
         */
        uint32_t mem_size_chm:3;
        uint32_t reserved_26:2;
        /** carrier_en_chm : R/W; bitpos: [28]; default: 1;
         *  Configures whether to enable carrier modulation on output signal for channel m.
         *  0: Disable
         *  1: Enable
         */
        uint32_t carrier_en_chm:1;
        /** carrier_out_lv_chm : R/W; bitpos: [29]; default: 1;
         *  Configures the position of carrier wave for channel m.
         *  0: Add carrier wave on low level
         *  1: Add carrier wave on high level
         */
        uint32_t carrier_out_lv_chm:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} rmt_chmconf0_reg_t;

/** Type of chmconf1 register
 *  Configuration register 1 for channel m
 */
typedef union {
    struct {
        /** rx_en_chm : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable the receiver to start receiving data in channel m.
         *  0: Disable
         *  1: Enable
         */
        uint32_t rx_en_chm:1;
        /** mem_wr_rst_chm : WT; bitpos: [1]; default: 0;
         *  Configures whether to reset RAM write address accessed by the receiver for channel
         *  m.
         *  0: No effect
         *  1: Reset
         */
        uint32_t mem_wr_rst_chm:1;
        /** apb_mem_rst_chm : WT; bitpos: [2]; default: 0;
         *  Configures whether to reset RAM W/R address accessed by APB FIFO for channel m.
         *  0: No effect
         *  1: Reset
         */
        uint32_t apb_mem_rst_chm:1;
        /** mem_owner_chm : R/W/SC; bitpos: [3]; default: 1;
         *  Configures the ownership of channel m's RAM block.
         *  0: APB bus is using the RAM
         *  1: Receiver is using the RAM
         */
        uint32_t mem_owner_chm:1;
        /** rx_filter_en_chm : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable the receiver's filter for channel m.
         *  0: Disable
         *  1: Enable
         */
        uint32_t rx_filter_en_chm:1;
        /** rx_filter_thres_chm : R/W; bitpos: [12:5]; default: 15;
         *  Configures whether the receiver, when receiving data, ignores the input pulse when
         *  its width is shorter than this register value in units of rmt_sclk cycles.
         *  0: No effect
         *  1: Reset
         */
        uint32_t rx_filter_thres_chm:8;
        /** mem_rx_wrap_en_chm : R/W; bitpos: [13]; default: 0;
         *  Configures whether to enable wrap RX mode for channel m.
         *  0: Disable
         *  1: Enable
         *  In this mode, if the RX data size is larger than channel m's RAM block size, the
         *  receiver stores the RX data from the first address to the last address in loops.
         */
        uint32_t mem_rx_wrap_en_chm:1;
        uint32_t reserved_14:1;
        /** conf_update_chm : WT; bitpos: [15]; default: 0;
         *  Synchronization bit for channel m.
         */
        uint32_t conf_update_chm:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} rmt_chmconf1_reg_t;

/** Type of sys_conf register
 *  Configuration register for RMT APB
 */
typedef union {
    struct {
        /** apb_fifo_mask : R/W; bitpos: [0]; default: 0;
         *  Configures the memory access mode.
         *  0: Access memory by FIFO
         *  1: Access memory directly
         */
        uint32_t apb_fifo_mask:1;
        uint32_t reserved_1:30;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  Configures whether to enable signal of RMT register clock gate.
         *  0: Power down the drive clock of registers
         *  1: Power up the drive clock of registers
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} rmt_sys_conf_reg_t;

/** Type of ref_cnt_rst register
 *  RMT clock divider reset register
 */
typedef union {
    struct {
        /** ref_cnt_rst_ch0 : WT; bitpos: [0]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL0.
         */
        uint32_t ref_cnt_rst_ch0:1;
        /** ref_cnt_rst_ch1 : WT; bitpos: [1]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL1.
         */
        uint32_t ref_cnt_rst_ch1:1;
        /** ref_cnt_rst_ch2 : WT; bitpos: [2]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL2.
         */
        uint32_t ref_cnt_rst_ch2:1;
        /** ref_cnt_rst_ch3 : WT; bitpos: [3]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL3.
         */
        uint32_t ref_cnt_rst_ch3:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} rmt_ref_cnt_rst_reg_t;


/** Group: Status registers */
/** Type of chnstatus register
 *  Channel n status register
 */
typedef union {
    struct {
        /** mem_raddr_ex_chn : RO; bitpos: [8:0]; default: 0;
         *  Represents the memory address offset when transmitter of channel n is using the RAM.
         */
        uint32_t mem_raddr_ex_chn:9;
        /** state_chn : RO; bitpos: [11:9]; default: 0;
         *  Represents the FSM status of channel n.
         */
        uint32_t state_chn:3;
        /** apb_mem_waddr_chn : RO; bitpos: [20:12]; default: 0;
         *  Represents the memory address offset when writes RAM over APB bus.
         */
        uint32_t apb_mem_waddr_chn:9;
        /** apb_mem_rd_err_chn : RO; bitpos: [21]; default: 0;
         *  Represents whether the offset address exceeds memory size when reading via APB bus.
         *  0: Not exceed
         *  1: Exceed
         */
        uint32_t apb_mem_rd_err_chn:1;
        /** mem_empty_chn : RO; bitpos: [22]; default: 0;
         *  Represents whether the TX data size exceeds the memory size and the wrap TX mode is
         *  disabled.
         *  0: Not exceed
         *  1: Exceed
         */
        uint32_t mem_empty_chn:1;
        /** apb_mem_wr_err_chn : RO; bitpos: [23]; default: 0;
         *  Represents whether the offset address exceeds memory size (overflows) when writes
         *  via APB bus.
         *  0: Not exceed
         *  1: Exceed
         */
        uint32_t apb_mem_wr_err_chn:1;
        /** apb_mem_raddr_chn : RO; bitpos: [31:24]; default: 0;
         *  Represents the memory address offset when reading RAM over APB bus.
         */
        uint32_t apb_mem_raddr_chn:8;
    };
    uint32_t val;
} rmt_chnstatus_reg_t;

